Revit 2027 API
GradientInterpolationType Enumeration
 The enumerated type representing the permitted values for the asset property "GradientInterpolation" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum GradientInterpolationType
Public Enumeration GradientInterpolationType
public enum class GradientInterpolationType
type GradientInterpolationType
Members
Member name | Value | Description
Custom | 0
Easein | 1
Easeinout | 2
Easeout | 3
Linear | 4
Solid | 5
See Also
Reference
Autodesk.Revit.DB.Visual Namespace